Based on the example from: https://kawahara.ca/python-pandas-how-to-groupby-and-aggregate-a-dataframe/

In [1]:
import pandas as pd

# Make up some data.
data = [
    {'unit': 'archer', 'building': 'archery_range', 'number_units': 1, 'civ': 'spanish'},
    {'unit': 'militia', 'building': 'barracks', 'number_units': 2, 'civ': 'spanish'},
    {'unit': 'pikemen', 'building': 'barracks', 'number_units': 3, 'civ': 'spanish'},
    {'unit': 'pikemen', 'building': 'barracks', 'number_units': 4, 'civ': 'huns'},
]

# Create the DataFrame.
df = pd.DataFrame(data)
# View the DataFrame.
df

      unit       building  number_units      civ
0   archer  archery_range             1  spanish
1  militia       barracks             2  spanish
2  pikemen       barracks             3  spanish
3  pikemen       barracks             4     huns

In [2]:
# Sum the number of units for each building type.
df.groupby(
    ['building'], as_index=False).agg(
    {'number_units':sum}
)

        building  number_units
0  archery_range             1
1       barracks             9

In [3]:
# Sum the number of units based on the building
# and civilization type.
df.groupby(
    ['building', 'civ'], as_index=False).agg(
    {'number_units':sum}
)

        building      civ  number_units
0  archery_range  spanish             1
1       barracks     huns             4
2       barracks  spanish             5

In [4]:
# Sum the number of units based on 
# the building and civilization type,
# and get the unit types in a list.
df.groupby(
    ['building', 'civ'], as_index=False).agg(
    {'unit':list, 'number_units': sum}
)

        building      civ                unit  number_units
0  archery_range  spanish            [archer]             1
1       barracks     huns           [pikemen]             4
2       barracks  spanish  [militia, pikemen]             5